app/views/battles/_form.html.erb

    <%= f.label :trainer_id %><br />
    <%= f.collection_select :trainer_id,
          Trainer.all, :id, :name, :prompt => 'Select trainer'
---
SELECT `trainers`.* FROM `trainers`