app/views/battles/index.html.erb

SELECT `trainers`.* FROM `trainers` WHERE `trainers`.`id` = 1 LIMIT 1
---
  <tr>
    <td><%= Trainer.find(battle.trainer_id).name %></td>