app/views/battles/show.html.erb

  <%= @trainer_active_pokemon.name %><br />
  <%= Move.find_by_name(@trainer_active_pokemon.move1).name %>,
  <%= Move.find_by_name(@trainer_active_pokemon.move1).power %> power
---
SELECT `moves`.* FROM `moves` WHERE `moves`.`name` = 'Tackle' LIMIT 1