app/controllers/battles_controller.rb

SELECT `battles`.* FROM `battles`
---
  def index
    @battles = Battle.all

SELECT `battles`.* FROM `battles` WHERE `battles`.`id` = 1 LIMIT 1
SELECT `trainers`.* FROM `trainers` WHERE `trainers`.`id` = 1 LIMIT 1
SELECT `pokemons`.* FROM `pokemons` WHERE `pokemons`.`trainer_id` = 1 AND `pokemons`.`id` = 1 LIMIT 1
---
  def show
    @battle = Battle.find(params[:id])
    @trainer = Trainer.find(@battle.trainer_id)
    @enemy = Trainer.find(@battle.enemy_id)

    @trainer_active_pokemon = @trainer.pokemons.find(@trainer.active_pokemon_id)

INSERT INTO `battles` (`complete`, `created_at`, `enemy_id`, `trainer_id`, `turns`, `updated_at`) VALUES (NULL, '2013-08-16 11:41:44', 2, 1, NULL, '2013-08-16 11:41:44')
---
  def create
    @battle = Battle.new(params[:battle])

    respond_to do |format|
      if @battle.save