app/controllers/moves_controller.rb

SELECT `moves`.* FROM `moves`
---
  def index
    @moves = Move.all

SELECT `moves`.* FROM `moves` WHERE `moves`.`id` = 1 LIMIT 1
---
  def show
    @move = Move.find(params[:id])

SELECT `moves`.* FROM `moves` WHERE `moves`.`id` = 1 LIMIT 1
---
  def edit
    @move = Move.find(params[:id])

INSERT INTO `moves` (`accuracy`, `created_at`, `critical`, `effect`, `move_type`, `name`, `power`, `pp`, `updated_at`) VALUES (100, '2013-08-17 00:10:51', 25, 'Damage', 'Normal', 'Tackel', 40, 35, '2013-08-17 00:10:51')
---
  def create
    @move = Move.new(params[:move])

    respond_to do |format|
      if @move.save

SELECT `moves`.* FROM `moves` WHERE `moves`.`id` = 1 LIMIT 1
UPDATE `moves` SET `move_type` = 'Normal', `updated_at` = '2013-08-17 00:10:31' WHERE `moves`.`id` = 1
---
  def update
    @move = Move.find(params[:id])

    respond_to do |format|
      if @move.update_attributes(params[:move])

SELECT `moves`.* FROM `moves` WHERE `moves`.`id` = 2 LIMIT 1
DELETE FROM `moves` WHERE `moves`.`id` = 2
---
  def destroy
    @move = Move.find(params[:id])
    @move.destroy