app/controllers/pokemon_stats_controller.rb

SELECT `pokemon_stats`.* FROM `pokemon_stats`
---
  def index
    @pokemon_stats = PokemonStat.all

INSERT INTO `pokemon_stats` (`attack`, `created_at`, `defense`, `hp`, `name`, `special_attack`, `special_defense`, `speed`, `updated_at`) VALUES (NULL, '2013-08-17 00:18:56', NULL, NULL, 'Bulbasaur', NULL, NULL, NULL, '2013-08-17 00:18:56')
---
  def create
    @pokemon_stat = PokemonStat.new(params[:pokemon_stat])

    respond_to do |format|
      if @pokemon_stat.save