app/controllers/pokemons_controller.rb

SELECT `trainers`.* FROM `trainers` WHERE `trainers`.`id` = 1 LIMIT 1
INSERT INTO `pokemons` (`created_at`, `hp`, `level`, `move1`, `move2`, `name`, `totalhp`, `trainer_id`, `type1`, `type2`, `updated_at`) VALUES ('2013-08-16 10:31:43', 24, 5, 'SCRATCH', '', 'BULBASAUR', 24, 1, 'GRASS', '', '2013-08-16 10:31:43')
---
  def create
    @trainer = Trainer.find(params[:trainer_id])
    @pokemon = @trainer.pokemons.create(params[:pokemon])

SELECT `trainers`.* FROM `trainers` WHERE `trainers`.`id` = 1 LIMIT 1
SELECT `pokemons`.* FROM `pokemons` WHERE `pokemons`.`id` = 1 LIMIT 1
---
  def edit
    @trainer = Trainer.find(params[:trainer_id])
    @pokemon = Pokemon.find(params[:id])

SELECT `trainers`.* FROM `trainers` WHERE `trainers`.`id` = 1 LIMIT 1
SELECT `pokemons`.* FROM `pokemons` WHERE `pokemons`.`id` = 1 LIMIT 1
UPDATE `pokemons` SET `name` = 'Bulbasaur', `type1` = 'Grass', `move1` = 'Tackle', `updated_at` = '2013-08-17 00:03:48' WHERE `pokemons`.`id` = 1
---
  def update
    @trainer = Trainer.find(params[:trainer_id])
    @pokemon = Pokemon.find(params[:id])

    respond_to do |format|
      if @pokemon.update_attributes(params[:pokemon])