app/controllers/trainers_controller.rb

SELECT `trainers`.* FROM `trainers`
---
  def index
    @trainers = Trainer.all

SELECT `trainers`.* FROM `trainers` WHERE `trainers`.`id` = 1 LIMIT 1
---
  def show
    @trainer = Trainer.find(params[:id])

INSERT INTO `trainers` (`active_pokemon_id`, `created_at`, `money`, `name`, `updated_at`) VALUES (NULL, '2013-08-16 10:30:57', 20000, 'Ash', '2013-08-16 10:30:57')
---
  def create
    @trainer = Trainer.new(params[:trainer])

    respond_to do |format|
      if @trainer.save

SELECT `trainers`.* FROM `trainers` WHERE `trainers`.`id` = 1 LIMIT 1
SELECT `pokemons`.* FROM `pokemons` WHERE `pokemons`.`trainer_id` = 1 AND `pokemons`.`id` = 1 LIMIT 1
UPDATE `trainers` SET `active_pokemon_id` = 1, `updated_at` = '2013-08-16 10:31:44' WHERE `trainers`.`id` = 1
---
  def set_active
    @trainer = Trainer.find(params[:trainer_id])
    @pokemon = @trainer.pokemons.find(params[:pokemon_id])

    @active_pokemon = @pokemon.name

    respond_to do |format|
      @trainer.update_attribute(:active_pokemon_id, @pokemon.id)